In [1]:
import pandas as pd
import numpy as np

In [4]:
ser = pd.Series(np.arange(3.))
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [9]:
ser.loc[2]
ser.iloc[2]
ser.iloc[-1]
#ser.loc[-1] 에러발생

2.0

In [10]:
ser2 = pd.Series(np.arange(3.), index=["a", "b", "c"])

In [11]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [14]:
ser2.loc['c']
ser2.iloc[2]
ser2.iloc[-1]

2.0

In [17]:
ser2[:2]
ser2.iloc[:2]

a    0.0
b    1.0
dtype: float64

In [19]:
ser2[:]

a    0.0
b    1.0
c    2.0
dtype: float64

In [20]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])

In [21]:
data
#one열에 모두 1을 저장하시오.

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [22]:
data['one'] = 1

In [23]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [25]:
data

          one  two  three  four
Ohio        1    1      2     3
Colorado    1    5      6     7
Utah        1    9     10    11
New York    1   13     14    15

In [27]:
#data['one']
data.loc[ : ,'one']=2

In [28]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        2    9     10    11
New York    2   13     14    15

In [30]:
data.iloc[2]=5

In [33]:
data
#four 열의 값이 5보다 큰 데이터를 추출하시오
data[data['four'] >5]

          one  two  three  four
Colorado    2    5      6     7
New York    2   13     14    15

In [35]:
data.loc[data['four'] >5]

          one  two  three  four
Colorado    2    5      6     7
New York    2   13     14    15

In [36]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [37]:
#three열 값이 5인 자료를 추출하시오
data[data['three'] == 5]

      one  two  three  four
Utah    5    5      5     5

In [41]:
#three열 값이 5인 자료의 two 열 값을 추출하시오
data[data['three'] == 5]['two']
data[data['three'] == 5].loc[:,'two']

Utah    5
Name: two, dtype: int32

In [46]:
type(data[data['three'] == 5]['two'])
data[data['three'] == 5]['two']

Utah    5
Name: two, dtype: int32

In [45]:
type(data[data['three'] == 5][['two']])

pandas.core.frame.DataFrame

In [47]:
data['two'][data['three'] == 5]

Utah    5
Name: two, dtype: int32

In [49]:
data['two'][data['three'] == 5]

Utah    5
Name: two, dtype: int32

In [52]:
data[data['three'] == 5]['two']

Utah    5
Name: two, dtype: int32

In [51]:
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5    5      5     5
New York    2   13     14    15

In [53]:
data[data['three'] == 5]['two']=10

C:\Users\박주하\AppData\Local\Temp\ipykernel_440\273983283.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data[data['three'] == 5]['two']=10

In [56]:
data.loc[data['three'] == 5,'two']=10

In [61]:
data
data.loc[data['three'] == 5, 'two']
data.loc[data.three == 5, 'two']=20
data

          one  two  three  four
Ohio        2    1      2     3
Colorado    2    5      6     7
Utah        5   20      5     5
New York    2   13     14    15

In [59]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
               index=["a", "c", "e", "f", "g"])

In [62]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [63]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [64]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [70]:
list("bcd")

['b', 'c', 'd']

In [72]:
#df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns=['b','c','d'])
df1 = pd.DataFrame(np.arange(9.).reshape(3,3),columns=list("bcd"),
                   index=["Ohio", "Texas", "Colorado"])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [73]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"),
                   index=["Utah", "Ohio", "Texas", "Oregon"])
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [74]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [75]:
df1 = pd.DataFrame({"A": [1, 2]})
df2 = pd.DataFrame({"B": [3, 4]})

In [76]:
df1

   A
0  1
1  2

In [77]:
df2

   B
0  3
1  4

In [78]:
df1+df2

    A   B
0 NaN NaN
1 NaN NaN

In [79]:
# 스타벅스 최적 입지 선정 프로젝트
# 거주인구, 스타벅스 매장 정보, 유동인구, 회사(관공소) 수...
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),
                   columns=list("abcd"))
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),
                   columns=list("abcde"))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [80]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [87]:
np.nan #결측값

nan

In [94]:
#df2['b'][1]=2
df2.loc[1, 'b']=np.nan
#df2.b[1]
#df2.loc[1, 'b']

In [96]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [95]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [99]:
#df1+df2
# a	b	c	d	e
# 0	0.0	2.0	4.0	6.0	NaN
# 1	9.0	NaN	13.0	15.0	NaN
# 2	18.0	20.0	22.0	24.0	NaN
# 3	NaN	NaN	NaN	NaN	NaN
df1.add(df2, fill_value=0) #fill_value=0 : NaN을 0으로 채워라

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [102]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [101]:
1/df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [106]:
#df1.div(2) #df/2
df1.rdiv(2) # 2/df
df1.rdiv(1) # 1/df

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [107]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [108]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [110]:
#df1.index
df1.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [111]:
df2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [112]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [113]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [115]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [116]:

arr = np.arange(12.).reshape((3, 4))
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [117]:
arr[0]

array([0., 1., 2., 3.])

In [119]:
arr-arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [120]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])

In [121]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [123]:
ser=frame.iloc[0]
ser

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [124]:
frame-ser

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [125]:

series2 = pd.Series(np.arange(3), index=["b", "e", "f"])
series2

b    0
e    1
f    2
dtype: int32

In [128]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [127]:
frame-series2

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [130]:
frame.sub(series2)

          b   d     e   f
Utah    0.0 NaN   1.0 NaN
Ohio    3.0 NaN   4.0 NaN
Texas   6.0 NaN   7.0 NaN
Oregon  9.0 NaN  10.0 NaN

In [133]:
frame = pd.DataFrame(np.random.standard_normal((4, 3)),
                     columns=list("bde"),
                     index=["Utah", "Ohio", "Texas", "Oregon"])
frame

               b         d         e
Utah    1.161038 -0.040398 -0.212691
Ohio   -0.375514 -0.023594  0.838014
Texas   0.698858  0.028276 -2.505124
Oregon -1.077136  0.152855 -0.880740

In [134]:
np.abs(frame)

               b         d         e
Utah    1.161038  0.040398  0.212691
Ohio    0.375514  0.023594  0.838014
Texas   0.698858  0.028276  2.505124
Oregon  1.077136  0.152855  0.880740

In [135]:
frame

               b         d         e
Utah    1.161038 -0.040398 -0.212691
Ohio   -0.375514 -0.023594  0.838014
Texas   0.698858  0.028276 -2.505124
Oregon -1.077136  0.152855 -0.880740

In [139]:
#열 단위로 최대값, 최소값 구해서 차를 출력
#max, min 함수
frame['b'].max()
frame['b'].min()
frame['b'].max()-frame['b'].min()

2.2381736978133855

In [145]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()
    # print(x)
    # print(x.max())
    # print(x.min())
    #print(x.max()-x.min())
    # print("="*50)
frame.apply(f1) #frame에 열 단위로 f1함수를 적용해라

b    2.238174
d    0.193253
e    3.343138
dtype: float64

In [147]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()
frame.apply(f1, axis='columns') #frame에 열 단위로 f1함수를 적용해라

Utah      1.373729
Ohio      1.213528
Texas     3.203981
Oregon    1.229991
dtype: float64

In [148]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()
frame.apply(f1, axis=1) #frame에 열 단위로 f1함수를 적용해라

Utah      1.373729
Ohio      1.213528
Texas     3.203981
Oregon    1.229991
dtype: float64

In [149]:
def f1(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max()-x.min()
frame.apply(f1, axis=0) #frame에 열 단위로 f1함수를 적용해라, axis=0 default

b    2.238174
d    0.193253
e    3.343138
dtype: float64

In [153]:
frame

               b         d         e
Utah    1.161038 -0.040398 -0.212691
Ohio   -0.375514 -0.023594  0.838014
Texas   0.698858  0.028276 -2.505124
Oregon -1.077136  0.152855 -0.880740

In [152]:
def f2(x): #f1함수에 각각의 열들이 하나씩 전달
    return x.max(), x.min()
frame.apply(f2, axis=0) #frame에 열 단위로 f1함수를 적용해라, axis=0 default

          b         d         e
0  1.161038  0.152855  0.838014
1 -1.077136 -0.040398 -2.505124

In [156]:
def f2(x): #f1함수에 각각의 열들이 하나씩 전달
    return pd.Series([x.max(), x.min()], index=['max', 'min'])
frame.apply(f2, axis=0) #frame에 열 단위로 f1함수를 적용해라, axis=0 default

            b         d         e
max  1.161038  0.152855  0.838014
min -1.077136 -0.040398 -2.505124

In [157]:
frame

               b         d         e
Utah    1.161038 -0.040398 -0.212691
Ohio   -0.375514 -0.023594  0.838014
Texas   0.698858  0.028276 -2.505124
Oregon -1.077136  0.152855 -0.880740

In [159]:
x=1.161038
print(f"{x:.2f}")

1.16

In [162]:
def my_format(x):
    return f"{x:.2f}"
frame.applymap(my_format)

C:\Users\박주하\AppData\Local\Temp\ipykernel_440\2920136714.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  frame.applymap(my_format) #frame에 열 단위로 f1함수를 적용해라, axis=0 default

            b      d      e
Utah     1.16  -0.04  -0.21
Ohio    -0.38  -0.02   0.84
Texas    0.70   0.03  -2.51
Oregon  -1.08   0.15  -0.88

In [166]:
# def my_format(x):
#     return f"{x:.2f}"
# frame['b'].applymap(my_format) #시리즈에서는 applymap을 사용할 수 없다

def my_format(x):
    return f"{x:.2f}"
frame['b'].map(my_format) #시리즈에서는 map함수를 사용하여 각 데이터를 변환

Utah       1.16
Ohio      -0.38
Texas      0.70
Oregon    -1.08
Name: b, dtype: object

In [167]:
import seaborn as sns

In [168]:
tips=sns.load_dataset("tips")
tips

     total_bill   tip     sex smoker   day    time  size
0         16.99  1.01  Female     No   Sun  Dinner     2
1         10.34  1.66    Male     No   Sun  Dinner     3
2         21.01  3.50    Male     No   Sun  Dinner     3
3         23.68  3.31    Male     No   Sun  Dinner     2
4         24.59  3.61  Female     No   Sun  Dinner     4
..          ...   ...     ...    ...   ...     ...   ...
239       29.03  5.92    Male     No   Sat  Dinner     3
240       27.18  2.00  Female    Yes   Sat  Dinner     2
241       22.67  2.00    Male    Yes   Sat  Dinner     2
242       17.82  1.75    Male     No   Sat  Dinner     2
243       18.78  3.00  Female     No  Thur  Dinner     2

[244 rows x 7 columns]

In [169]:
def max_min(x):
    return x.max(), x.min()
pd.DataFrame(tips['tip']).apply(max_min)

    tip
0  10.0
1   1.0

In [175]:
tips['tip'].max()-tips['tip'].min()

9.0

In [176]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),
                     index=["three", "one"],
                     columns=["d", "a", "b", "c"])
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [177]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [179]:
frame.sort_index(axis="columns")
frame.sort_index(axis="columns", ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [180]:
obj = pd.Series([4, 7, -3, 2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [182]:
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [184]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])
obj

0    4.0
1    NaN
2    7.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [185]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [186]:
obj.sort_values(ascending=False)

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [187]:
obj.sort_values(na_position='first')

1    NaN
3    NaN
4   -3.0
5    2.0
0    4.0
2    7.0
dtype: float64

In [188]:

frame = pd.DataFrame({"b": [4, 7, -3, 2], "a": [0, 1, 0, 1]})
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [191]:
frame.sort_values('a')
frame.sort_values(['a', 'b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [192]:
obj = pd.Series([7, -5, 7, 4, 2, 0, 4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [193]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [194]:
obj.rank(method="first")

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [195]:
obj.rank(ascending=False)

0    1.5
1    7.0
2    1.5
3    3.5
4    5.0
5    6.0
6    3.5
dtype: float64

In [196]:
frame = pd.DataFrame({"b": [4.3, 7, -3, 2], "a": [0, 1, 0, 1],
                      "c": [-2, 5, 8, -2.5]})
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [200]:
frame.rank() #frame.rank(axis=0)
frame.rank(axis=1)
frame.rank(axis=1, ascending=False)
#axis=0 == index, axis=1 == columns

     b    a    c
0  1.0  2.0  3.0
1  1.0  3.0  2.0
2  3.0  2.0  1.0
3  1.0  2.0  3.0

In [202]:
frame.rank(axis=1)
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [203]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [204]:
obj.index.is_unique

False

In [205]:
obj['a']

a    0
a    1
dtype: int32

In [206]:
df = pd.DataFrame(np.random.standard_normal((5, 3)),
                  index=["a", "a", "b", "b", "c"])
df

          0         1         2
a -0.220533 -0.226313  0.436564
a  0.355499 -0.677051 -0.243872
b -0.537276 -0.228969 -2.136141
b  2.628979 -1.112077 -1.560433
c  0.346525 -0.569619  0.948836

In [207]:
df.loc["b"]

          0         1         2
b -0.537276 -0.228969 -2.136141
b  2.628979 -1.112077 -1.560433

In [208]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=["a", "b", "c", "d"],
                  columns=["one", "two"])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [209]:
df.sum()
#axis=0 == index, axis=1 == columns

one    9.25
two   -5.80
dtype: float64

In [211]:
df.sum(axis=0)
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [212]:
df.sum(axis=0)

one    9.25
two   -5.80
dtype: float64

In [213]:
df.sum(axis='index')

one    9.25
two   -5.80
dtype: float64

In [214]:
df.sum(axis='index', skipna=False)

one   NaN
two   NaN
dtype: float64

In [216]:
df
df.mean()

one    3.083333
two   -2.900000
dtype: float64

In [217]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [219]:
df.idxmax()

one    b
two    d
dtype: object

In [220]:

df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [221]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [223]:
df.describe() #기술통계
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   one     3 non-null      float64
 1   two     2 non-null      float64
dtypes: float64(2)
memory usage: 268.0+ bytes

In [224]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [225]:
pd.read_csv("data/datasets/titanic/train.csv")
#pd.read_csv("../data/datasets/titanic/train.csv") 현재 파일 위치를 기준으로 한단계 상위폴더로 이동한 다음 data폴더~ 이동

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [229]:
df=pd.read_csv("pew.csv")
#df.info()
df.describe()

,<$10k,$10-20k,$20-30k,$30-40k,$40-50k,$50-75k,$75-100k,$100-150k,>150k,Don't know/refused
count,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000,18.000000
mean,107.222222,154.500000,186.500000,183.444444,171.388889,288.055556,221.666667,177.611111,144.888889,340.055556
std,168.931784,255.172433,309.891869,291.470354,271.144446,458.442436,345.078849,275.679724,205.224952,530.523878
min,1.000000,2.000000,3.000000,4.000000,2.000000,7.000000,3.000000,4.000000,4.000000,8.000000
25%,12.250000,14.750000,17.000000,15.750000,15.000000,34.250000,25.250000,22.500000,23.750000,41.250000
50%,20.000000,27.000000,33.500000,40.000000,34.000000,66.500000,65.500000,48.500000,53.500000,74.500000
75%,170.000000,193.000000,192.000000,198.750000,166.750000,201.500000,128.750000,103.500000,134.250000,294.750000
max,575.000000,869.000000,1064.000000,982.000000,881.000000,1486.000000,949.000000,792.000000,634.000000,1529.000000

In [230]:
df=pd.read_csv("tesla_stock_quandl.csv")
df

,Date,Open,High,Low,Close,Volume,ExDividend,SplitRatio,AdjOpen,AdjHigh,AdjLow,AdjClose,AdjVolume
0,2018-03-27,304.00,304.2700,277.18,279.18,13696168.0,0.0,1.0,304.00,304.2700,277.18,279.18,13696168.0
1,2018-03-26,307.34,307.5900,291.36,304.18,8324639.0,0.0,1.0,307.34,307.5900,291.36,304.18,8324639.0
2,2018-03-23,311.25,311.6100,300.45,301.54,6600538.0,0.0,1.0,311.25,311.6100,300.45,301.54,6600538.0
3,2018-03-22,313.89,318.8200,308.18,309.10,4914307.0,0.0,1.0,313.89,318.8200,308.18,309.10,4914307.0
4,2018-03-21,310.25,322.4400,310.19,316.53,5927881.0,0.0,1.0,310.25,322.4400,310.19,316.53,5927881.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1944,2010-07-06,20.00,20.0000,15.83,16.11,6866900.0,0.0,1.0,20.00,20.0000,15.83,16.11,6866900.0
1945,2010-07-02,23.00,23.1000,18.71,19.20,5139800.0,0.0,1.0,23.00,23.1000,18.71,19.20,5139800.0
1946,2010-07-01,25.00,25.9200,20.27,21.96,8218800.0,0.0,1.0,25.00,25.9200,20.27,21.96,8218800.0
1947,2010-06-30,25.79,30.4192,23.30,23.83,17187100.0,0.0,1.0,25.79,30.4192,23.30,23.83,17187100.0
1948,2010-06-29,19.00,25.0000,17.54,23.89,18766300.0,0.0,1.0,19.00,25.0000,17.54,23.89,18766300.0

In [233]:
df=pd.read_csv("gapminder.tsv", sep="\t")
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [239]:
# df.head()
# df.tail()
# df.info()
# df.columns
df.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [240]:
#Zimbabwe 데이터만 추출하시오
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [249]:
#df[df['country']=='Zimbabwe'].info()
df[df['continent']=='Africa'].shape[0]/12

52.0

In [250]:
df[df['continent']=='Africa']

       country continent  year  lifeExp       pop    gdpPercap
24     Algeria    Africa  1952   43.077   9279525  2449.008185
25     Algeria    Africa  1957   45.685  10270856  3013.976023
26     Algeria    Africa  1962   48.303  11000948  2550.816880
27     Algeria    Africa  1967   51.407  12760499  3246.991771
28     Algeria    Africa  1972   54.518  14760787  4182.663766
...        ...       ...   ...      ...       ...          ...
1699  Zimbabwe    Africa  1987   62.351   9216418   706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340   693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948   792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563   672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143   469.709298

[624 rows x 6 columns]